docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-17 Fri 10:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="./css/default.css" />
<link rel="stylesheet" href="./css/mathjax_fonts.css" />
<link rel="stylesheet" href="./css/syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="./index.html">Mario Román</a>
</div>
<div id="navigation">
<a href="./index.html">About</a>
<a href="./posts/index.html">Blog</a>
<a href="https://github.com/mroman42/">Github</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">About</h1>
<p>
Hi! I'm <b>Mario Román</b>.  I am studying a PhD at <a href="https://www.ttu.ee/">Tallinn University of Technology</a> 
under the supervision of <a href="https://www.ioc.ee/~pawel/">Pawel Sobociński</a>; my main interests being
<a href="https://en.wikipedia.org/wiki/Category_theory">categories</a> and <a href="https://en.wikipedia.org/wiki/Functional_programming">functional programming</a>.  Before this, I
studied an MSc on Mathematics and Computer
Science at the University of Oxford.  Even before, completed
two bachelor's degrees in Mathematics and Computer Engineering at
the <a href="https://www.ugr.es/en/">University of Granada</a> (Spain).  I am a
founder and ex-organizer of a local free software community (<a href="https://libreim.github.io/">LibreIM</a>), 
for which I still write articles and organize seminars.
</p>

<ul class="org-ul">
<li>GitHub: <a href="https://github.com/mroman42">@mroman42</a></li>
<li>GitLab: <a href="https://gitlab.com/mroman42">@mroman42</a></li>
<li>CV: <a href="https://mroman42.github.io/friggeri-cv-a4/cv.pdf">My CV on Github pages</a>.</li>
<li>Email: <a href="mailto:mromang08+blog@gmail.com">mromang08+cosmoi@gmail.com</a></li>
<li>Mastodon: <a href="https://mastodon.social/@mroman42">@mroman42@mastodon.social</a></li>
</ul>

<p>
All the articles in this page are licensed under <a href="https://creativecommons.org/licenses/by-sa/2.0/">Creative Commons BY-SA 2.0</a>
unless otherwise specified.
</p>

<p>
<br />
</p>

<p>
<br />
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org30a3524">Papers</a></li>
<li><a href="#orgb4c052e">External Posts</a></li>
<li><a href="#org801b640">Talks</a></li>
<li><a href="#org9087f27">Short notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org30a3524" class="outline-2">
<h2 id="org30a3524">Papers</h2>
<div class="outline-text-2" id="text-org30a3524">
<ul class="org-ul">
<li><b><a href="http://jose.theoj.org/papers/8324e9aa1019760e987673f55e335f34">Mikrokosmos: an educational lambda interpreter</a></b>. <i>Mario Román</i>. The
Journal of Open Source Education, 2018.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb4c052e" class="outline-2">
<h2 id="orgb4c052e">External Posts</h2>
<div class="outline-text-2" id="text-orgb4c052e">
<ul class="org-ul">
<li><a href="https://libreim.github.io/blog/2016/12/21/monadas/"><b>Mónadas</b></a>, LibreIM 2016.</li>
<li><a href="https://libreim.github.io/blog/2016/09/19/aprendiendo-emacs/"><b>Aprendiendo Emacs</b></a>, LibreIM 2016.</li>
</ul>
</div>
</div>

<div id="outline-container-org801b640" class="outline-2">
<h2 id="org801b640">Talks</h2>
<div class="outline-text-2" id="text-org801b640">
<ul class="org-ul">
<li><b><a href="https://mroman42.github.io/nwpt19-optics-talk/slides.pdf">Profunctor optics: a categorical update</a></b>. NWPT'19 <i>(15th November 2019, Taltech)</i>.</li>
<li><b><a href="https://mroman42.github.io/syco5-optics-talk/profunctoroptics.pdf">Profunctor optics: a categorical update.</a></b> SYCO5 <i>(5th September 2019, Birmingham)</i>.</li>
<li><b><a href="./mfocs-profunctoroptics-presentation.pdf">Profunctor optics: a categorical update</a></b> MFoCS dissertation proposals. (<i>14th June 2019, University of Oxford</i>)</li>
<li><b><a href="https://mroman42.github.io/ctlc-slides/slides.pdf">Category Theory and Lambda Calculus</a></b>, BSc Dissertation defense. <i>(24th June 2018, <a href="https://fciencias.ugr.es/en/">Universidad de Granada</a>)</i></li>
<li><b><a href="https://mroman42.github.io/cosmoi/monoidescoloreadosbimonoidescoloreados.pdf">Monoides coloreados, bi(monoides coloreados)</a></b>. <i>(26th April 2019, <a href="https://wpd.ugr.es/~iemath/">IEMath</a>)</i></li>
<li><b><a href="https://mroman42.github.io/libreim-constructiva/constructiva.pdf">Ideas sobre constructivismo y computabilidad</a></b>. <i>(21st September 2018, <a href="https://wpd.ugr.es/~iemath/">IEMath</a>)</i></li>
<li><b><a href="https://github.com/mroman42/lambda.notes">Lógica intuicionista y cálculo lambda</a></b>. <i>(19th January 2018, <a href="https://wpd.ugr.es/~iemath/">IEMath</a>)</i></li>
<li><b><a href="https://github.com/mroman42/lambda.notes">Categorías, funtores y transformaciones naturales</a></b>. <i>(18th November 2017, <a href="https://wpd.ugr.es/~iemath/">IEMath</a>)</i></li>
</ul>
</div>
</div>

<div id="outline-container-org9087f27" class="outline-2">
<h2 id="org9087f27">Short notes</h2>
<div class="outline-text-2" id="text-org9087f27">
<ul>
 <li><a href=traversals.pdf> The traversal is the optic for polynomial functors</a>, <em> (24th May, 2019)</em><br></li>
 <li><a href=monoidesgrouposcategorias.pdf> Monoides, groupos, grupoides, categorías</a>, <em> (1 de abril de 2019)</em><br></li>
 <li><a href=monoidescoloreadosbimonoidescoloreados.pdf> Monoides coloreados y bi(monoides coloreados)</a>, <em> (14 de abril de 2019)</em><br></li>
 <li><a href=diagramascategoriasmonoidales.pdf> Diagramas para categorías monoidales</a>, <em> (21st January 2019)</em><br></li>
 <li><a href=everysurjectiontoprojectiveissplit.pdf> Every surjection to a projective R-module is split</a>, <em> (24th December 2018)</em><br></li>
 <li><a href=pastingpullbacks.pdf> Pasting pullbacks</a>, <em> (23rd December 2018)</em><br></li>
 <li><a href=countinginlinearlogic.pdf> Linear logic is quantity-sensitive</a>, <em> (23th December 2018)</em><br></li>
 <li><a href=powersetalgebrascompletesemilattices.pdf> Powerset-algebras are complete semilattices</a>, <em> (23th December 2018)</em><br></li>
 <li><a href=uniquenessofidentityproofs.pdf> Uniqueness of identity proofs</a>, <em> (25th August 2018)</em><br></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mario Román (<a href="mailto:mromang08@gmail.com">mromang08@gmail.com</a>)</p>
<p class="date">Date: 26 December 2019</p>
<p class="creator"><a href="https://mroman42.github.com">@mroman42</a>.</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
